String privacyPolicy = '''
“SButler”隐私政策

本隐私政策将帮助您了解：
SButler（以下简称“我们”）非常重视用户的隐私和个人信息的保护。您在使用SButler时，我们可能会收集和使用您的相关信息。我们深知个人信息本身，基于更好的地向您展示和说明我们的隐私规则和您的用户权限，以及向您说明SButler如何收集，使用和存储您的个人信息以及您所有权的权利，我们将在本隐私保护指引中我们将逐一说明我们收集的您的个人信息类型及其对应的用途，方便您了解我们针对特定功能所收集的具体个人信息的类别，使用理由及收集方式。
在使用SButler前，请您仔细阅读并穿透彻理解本保护指南，特别是与您信息及重要权利相关的内容将以加粗的形式提示您，请您重点阅读。请在确认充分理解并同意后使用相关产品或服务。如果您不同意本隐私保护指南任何内容，您应立即停止使用SButler。一旦您开始使用SButler，即表示您已充分理解并同意本隐私保护指南。
适用范围
本隐私保护只适用于SButler。
定义
1.个人信息：指以电子或其他方式记录的、能够单独或与其他信息结合识别特定自然人身份或反映特定自然人活动情况的各种信息。
2.个人敏感信息：指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉，生理健康受到损害或歧视性替换等的个人信息，包括身份证件号码，个人生物识别信息，银行帐户，通信内容，健康生理信息等。故在提供任何属于敏感信息的个人信息前，请您清楚考虑这些提供是正确的并且同意您的个人敏感信息可按本指引所述的目的和方式进行处理。
基本原则
我们将遵循合法、合理、必要的原则并根据本指引所述的目的，收集、使用和储存您在使用SButler过程中主动提供或因使用而产生的个人信息。如果我们要将您的个人信息用于本指引未载明的其它用途，或基于特定目的将收集而来的信息用于其他目的，我们将在使用前，再次向您告知并征得您的同意。
本隐私政策旨在帮助您了解以下内容：
一、我们如何收集和使用个人信息
二、我们对Cookie和同类技术的使用
三、我们如何存储个人信息
四、我们如何共享、转让、公开披露个人信息
五、我们如何保护个人信息的安全
六、您如何访问和管理您的个人信息
七、未成年人使用条款
八、隐私政策的修订和通知
九、适用范围
十、其他

一、我们如何收集和使用个人信息
在您使用“SButler”软件及服务的过程中，我们将根据合法、正当、必要的原则，需要/可能需要收集和使用您的个人信息。我们收集的或请您提供的信息将可能在下列情况下使用
1.保障产品的基础正常运行；
2.实现各项功能和服务；
3.优化、改善产品和服务；
4.用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，保障我们向您提供的产品、服务以及用户使用的安全性；
5.向您推荐您可能感兴趣的内容，包括但不限于向您发出产品、服务信息或有关广告，通过系统向您展示个性化的第三方推广信息或者在征得您同意的情况下与我们的合作伙伴共享信息以便他们向您发送有关其产品和服务的信息；
6.我们可能会将您的个人信息与其他服务信息结合起来，用于为了给您提供更加个性化的服务使用，例如让您拥有更广泛的社交圈的需要而使用、共享或披露；
7.让您参与有关我们产品和服务的促销及抽奖活动；
8.使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如位置设定、个性化的帮助服务和指示或对您和其他用户作出其他方面的回应；
9. 经您许可的其他用途；
10. 遵循法律法规与国家标准的规定。
我们收集、使用上述信息时进行了去标识化处理，即数据分析仅对应特定的、无法直接关联用户身份的编码，无法与您的真实身份相关联。
（一）我们主动收集与使用的个人信息
为实现以及更好地提供本隐私政策下述的各项功能和服务，我们会按照如下方式收集您在使用服务时主动提供的，以及您在使用功能或接受服务过程中产生的信息。如果我们将您的个人信息用于本政策未载明的其他用途，或基于其他特定目的而收集您的个人信息，我们将以合理的方式告知您，并在使用前再次征得您的同意。
1.保障“SButler”和服务的正常运行
当您使用“SButler”及相关服务时，为了保障软件与服务的正常运行，您正常使用SButler的基础功能和正常服务、改进及优化我们的服务体验、识别账号异常，我们会在您同意后后台/静默收集您的设备识别码（包括IMSI/IMEI/Android ID/IDFA/） 、MCC、MNC、MAC地址信息（手机MAC地址和蓝牙MAC地址） 、设备运行状态信息、系统版本、软件列表、IP地址、软件版本号、网络接入方式及类型和状态、操作日志、服务日志信息（如您在SButler搜索、查看的信息、服务故障信息等信息）等信息。请您了解，这些信息是我们提供服务和保障产品正常运行所必须收集的基本信息。收集这些信息是为了帮助我们进行BUG分析、反作弊、反黑产等安全保护工作，保障您正常使用本产品与服务、改进和优化我们的产品体验、保护您的账号安全，这些信息是我们提供服务和保障产品正常运行所必须收集的基本信息。收集这些信息时，我们会请求您授权我们读取/写入外置存储器的权限以便我们进行存储，我们不会访问、改变您存储器中与SButler无关的内容。请注意，单独的设备信息、服务日志信息是无法识别特定自然人身份的信息，除取得您授权或法律法规另有规定外，我们不会将上述信息与您在应用程序中提供的任何个人身份信息相结合。
2.注册、认证、登录“SButler”和相关服务
（1）当您注册、登录“SButler”及相关服务时，您可以通过手机号创建账号，我们将通过发送短信验证码来验证您的身份是否有效，并且您可完善相关的网络身份识别信息（如头像、昵称和密码等），收集这些信息是为了帮助您完成注册。手机号码及手机短信属于敏感信息，收集上述信息是为了满足相关法律法规的网络实名制要求。通过注册验证且您阅读并同意本隐私政策及用户协议后，将完成账号注册。提示您注意，您提供的手机号码将作为您后续使用SButler的用户账号并作为登录本产品的用户身份凭证。若您不提供这类信息，您可能无法正常使用我们的服务，但不影响您正常使用SButler语音的其他功能。您还可根据自身需求选择填写性别、生日、地区及介绍等信息完善您的个人信息。如果您完善以上额外信息，将有助于我们为您提供更好的服务和体验，但如果您不提供上述信息，将不会影响使用产品的基本功能。
（2）您也可以使用第三方账号（如微信、QQ等）登录进入SButler，您此时将授权我们获取您在第三方平台注册的公开信息（头像、昵称等），并在您同意本隐私政策后将您的第三方账号与您的SButler账户绑定，使您可以通过第三方账号直接登录并使用SButler产品和相关服务。如果您不同意授权或拒绝我们获取上述信息，您将无法通过第三方账号登录产品，但不影响您正常使用产品的其他功能。
（3）在您使用直播、提现等需进行身份认证的功能或服务时，根据中华人民共和国相关法律法规，您可能需要提供您的真实身份信息（真实姓名、电话号码等）以完成实名验证。实名信息需是您本人的真实信息，平台只对实名信息登记人提供平台服务及后续的所有责任。请您保管好个人信息，不要被盗用或者盗用别人的实名信息进行平台验证。如您不提供这些信息，您将不能使用直播、提现功能，但您可以继续使用“SButler”的其他服务。这些信息属于个人敏感信息，但收集上述信息为实现相关功能所必须，我们将采用行业内通行的方式及尽最大的商业努力来保护您个人敏感信息的安全。如果您不提供这些信息，您将可能无法获得相关服务，但不影响“SButler”其他功能与服务的正常使用。
3.为您提供音视频、信息发布与直播等功能或服务
您主动进行直播、聊天、发布文字、评论时，我们将收集音频等信息，并展示您的昵称、头像、发布信息和内容等：
（1）您可以浏览的内容包括房间列表、房间、个人资料页、排行榜、主播资料等；在浏览的过程中，您可以关注您感兴趣的用户，也可以加他为好友进行消息互动；您也可以点击我的房间创建个人房间，也可以创建公会，还可以加入他人房间进行互动，在此过程中您可使用平台上麦功能。为此我们会请求您授权我们可能会收集使用SButler的设备信息，如设备型号、唯一设备标识符、操作系统、分辨率、运营商、电话号码等软硬件信息，并可能访问您手机设备的应用列表信息及麦克风、相册、相机等功能。您如果拒绝授权提供，将无法使用此功能，但不影响您正常使用SButler的其他功能。
（2）请注意，您公开发布的信息中可能会涉及您或他人的个人信息甚至个人敏感信息，如您选择上传包含个人信息的图片或音频，请您更加谨慎地考虑，是否在使用我们的服务时共享甚至公开分享相关信息。您上传的音频、文字、图片及进行直播等信息会存储在我们的服务器中，因为存储是实现这一功能所必需的。您也可以随时删除这些信息。除非经您自主选择或遵从相关法律法规要求，我们不会对外提供上述信息，或者将其用于该功能以外的其他用途。
4.为您提供互动功能或服务
（1）您主动关注您感兴趣的账号并与其他账号进行互动，进行评论或分享内容时，我们会收集您关注的账号，并向您展示您关注账号发布内容。
5.为您提供搜索服务
您使用SButler的搜索服务时，我们会收集您的搜索关键字信息、日志记录等。为了提供高效的搜索服务，部分前述信息会暂时存储在您的本地存储设备之中，并可向您展示搜索结果内容、搜索历史记录。
6.帮助您购买、查询、使用虚拟财产
为了方便您查询虚拟财产，并尽量降低可能存在的风险，【钱包】会记录充值、余额与使用情况。
这些信息是您使用钱包功能所必需，拒绝提供会使您无法使用钱包功能，但不影响您正常使用其他功能
7.开展营销活动
当您选择参加我们举办的有关营销活动时，根据活动需要您可能提供姓名、通信地址、联系方式、银行账号等信息。这些信息中可能包含个人敏感信息（如个人电话号码、银行账号等），这是您收到转账或者礼品所必要的，如果您拒绝提供这些信息，我们将可能无法向您转账或发放礼品，但不影响您正常使用产品的其他功能。
8.保障产品、服务及用户使用安全
为帮助我们更好地了解“SButler”及相关服务的运行情况，以便确保运行与提供服务的安全，我们可能记录网络日志信息，以及使用软件及相关服务的频率、崩溃数据、总体安装、使用情况、性能数据等信息

（二）我们可能从第三方获得您的个人信息
1.基于我们与通信运营商的合作，您使用“SButler”密码登录、填写手机验证码、第三方账号登录等。手机号码属个人敏感信息，您有权拒绝提供，但这会将使得您无法使用“一键登录”方式注册登录“SButler”，但不影响您通过其他方式注册登录，也不影响其他功能的正常使用。
2.当您使用第三方账号登录“SButler”时，经过您的明示授权同意，我们会收集第三方账号的昵称、头像等信息，并在您同意本隐私政策后将您的第三方账户与您的账户绑定，使您可以通过第三方账户直接登录并使用我们的产品或服务。
3.用户因使用我们的产品或者服务而被我们收集的信息，例如其他用户发布的信息中可能含有您的部分信息。
4.在您使用“SButler”软件及相关服务提供的身份认证功能时，我们会根据相关法律法规规定和/或该身份认证功能所必需，我们将采用行业内通行的方式及尽最大的商业努力来保护您个人敏感信息的安全。如果您不提供这些信息，您将可能无法获得相关服务。
5. 为了给您提供更好的服务或为了预防互联网犯罪，我们的关联公司、合作伙伴会依据法律的规定或征得您同意的前提下，向我们分享您的个人信息。我们会将依据与第三方的约定、对个人信息来源的合法性进行确认后，在符合相关法律和法规规定的前提下，使用您的这些个人信息。
（三）收集、使用个人信息目的变更的处理
请您了解并同意，随着我们业务的发展，为给您带来更好的产品和服务体验，我们在持续努力改进我们的技术，可能会对“SButler”的功能和提供的服务有所调整变化。当新的或优化的功能或服务与个性化音频推荐、直播、发布信息、用户推荐、互动交流、搜索查询、注册认证、虚拟财产等场景相关时，收集与使用的个人信息属于与原目的具有直接或合理关联。在与原目的无直接或合理关联的场景下我们可能需要收集、使用您的个人信息的，或者需要变更个人信息使用目的或方式的，对此，我们将通过更新本隐私政策、弹窗、页面提示等方式会再次进行告知另行向您说明对应信息的收集目的、范围及使用方式，并征得您的同意。并为您提供自主选择同意的方式，且在征得您明示同意后收集、使用。在此过程中，如果您有任何疑问、意见或建议的，您可通过文末所示的联系方式或平台客服联系方式与我们联系，我们会尽快为您作出解答。
请您注意，您开启任一权限即代表您授权我们可以收集和使用相关个人信息来为您提供对应服务，您一旦关闭任一权限即代表您取消了相应授权，我们将不再基于对应权限继续收集和使用相关个人信息，也无法为您提供该权限所对应的服务。但是，您关闭权限的决定不会影响此前基于您的授权所进行的信息收集及使用。
（四）依法豁免征得同意收集和使用的个人信息
请您理解，在下列情形中，根据法律法规及相关国家标准，我们收集和使用您的个人信息无需征得您的授权同意，且我们可能不会同意您提出的更正/修改、删除、注销、撤回同意、索取信息的请求：
（1）与国家安全、国防安全相关的；
（2）与公共安全、公共卫生、重大公共利益相关的；
（3）与犯罪侦查、起诉、审判和判决执行等相关的；
（4）出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
（5）所收集的您的个人信息是您自行向社会公众公开的；
（6）从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道；
（7）根据您的要求签订或履行合同所必需的；
（8）用于维护“SButler”软件及相关服务的安全稳定运行所必需的，例如发现、处置“SButler”软件及相关服务的故障；
（9）为合法的新闻报道所必需的；
（10）学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；
（11）法律法规规定的其他情形。
特别提示您注意，如信息无法单独或结合其他信息识别到您的个人身份，其不属于法律意义上您的个人信息；故根据适用的法律，若我们对个人信息采取技术措施和其他必要措施进行处理，使得数据接收方无法重新识别特定个人且不能复原，则此类处理后数据的共享、转让、公开披露无需另行向您通知并征得您的同意。当您的信息可以单独或结合其他信息识别到您的个人身份时或我们将无法与任何特定个人信息建立联系的数据与其他您的个人信息结合使用时，则在结合使用期间，这些信息将作为您的个人信息按照本隐私政策处理与保护。
请理解，由于SButler服务的更新迭代，如果某一功能或服务未及时在本隐私政策中声明收集了您的信息，我们仍然会通过页面提示、交互流程、公告等方式另行向您说明信息收集的内容、范围和目的，以征得您的授权同意。
如我们停止运营SButler产品或服务，我们将及时停止继续收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，对所持有的个人信息进行删除或匿名化处理。

二、对Cookie和同类技术的使用
Cookie和同类技术是互联网中的通用常用技术。当您使用“SButler”软件及相关服务时，我们可能会使用相关技术向您的设备发送一个或多个Cookie或匿名标识符，以收集和存储您访问、使用本产品时的信息。我们或我们的第三方合作伙伴可能通过cookie或同类技术收集您的信息，包括您的设备信息、浏览信息、点击信息，并将该等信息储存为日志信息，用于记住您的身份、分析您使用我们服务的情况、优化广告投放。
请您理解，我们的某些服务只能通过使用“Cookie”才可得到实现。如果您的浏览器或浏览器附加服务允许，您可以修改对Cookie的接受程度或者拒绝我们的Cookie，但这一举动在某些情况下可能会影响您安全使用我们平台提供的服务。您可以通过浏览器设置拒绝或管理cookie或同类技术的使用，但请注意，如果停用cookies或web beacon，您有可能无法享受佳的服务体验，某些服务也可能无法正常使用。同时，您还会收到同样数量的广告，但这些广告与您的相关性会降低。
同时，我们也会使用第三方SDK实现以上采集和使用，其中，如您使用小米、魅族、华为、OPPO、VIVO手机的，SButler接入的上述手机厂商Push SDK需要收集手机唯一标识信息（例如IMEI），并可能会收集您的手机型号、系统类型、系统版本、设备屏幕尺寸等参数用于实现推广活动等信息的推送；。
我们使用Cookie和同类技术主要为了实现以下功能或服务：
（一）保障产品与服务的安全、高效运转
我们可能会设置认证与保障安全性的cookie或匿名标识符，使我们确认您是否安全登录服务，或者是否遇到盗用、欺诈等不法行为。这些技术还会帮助我们改进服务效率，提升登录和响应速度。
（二）帮助您获得更轻松的访问体验
使用此类技术可以帮助您省去重复您填写个人信息、输入搜索内容的步骤和流程（例如：实现一键登录流程、记录搜索历史）。
（三）为您推荐、展示、推送您可能感兴趣的内容或账号
我们可能会利用Cookie和同类技术（例如Beacon、Proxy等技术）了解您的偏好和使用习惯，进行咨询或数据分析，以改善产品服务及用户体验，并优化您对广告的选择。
我们承诺，我们不会将Cookie用于本隐私政策所述目的之外的任何其他用途。
我们的产品和服务上可能会有广告商或其他合作方放置的cookies和web beacon。这些cookies和web beacon可能会收集与您相关的非个人身份信息，以用于分析用户如何使用该等服务、向您发送您可能感兴趣的广告，或用于评估广告服务的效果。这些第三方cookies和web beacon收集和使用该等信息，不受本隐私政策约束，而是受相关使用者的隐私政策约束，我们不对第三方的cookies或web beacon承担责任。

三、我们如何存储个人信息
（一）信息存储的地点
我们依照法律法规的规定，将在中国境内运营过程中收集和产生的您的个人信息存储于中华人民共和国境内。目前，我们不会将上述信息传输至中国境外，如果我们向中国境外传输，我们将会遵循法律法规的规定，征求您的明示同意。
（二）存储期限
我们仅在为提供“SButler”及服务之目的所必需的合理必要期间内保留您的个人信息。例如，您发布的音视频等信息，在您未撤回、删除或未注销账号期间，我们会持续保留相关信息。如果您注销帐户或主动删除上述信息，我们将依据网络安全法等法律法规规定保存您的信息。超出合理必要期限后，我们将对您的个人信息进行删除或匿名化处理，但法律法规另有规定的除外。当我们的产品或服务发生停止运营的情形时，我们将以推送通知、公告等形式通知您，并在合理的期限内删除您的个人信息或进行匿名化处理。
在下列情况下，我们有可能因需符合法律要求，更改个人信息的存储期限：
（1）为遵守适用的法律法规等有关规定；
（2） 为遵守法院判决、裁定或其他法律程序的规定；
（3）为遵守相关政府机关或法定授权组织的要求；
（4）我们有理由确信需要遵守法律法规等有关规定。
（5）为执行相关服务协议或本政策、维护社会公共利益，为保护客户、我们或我们的关联公司、其他用户或雇员的人身财产安全或其他合法权益所合理必需的用途。

四、我们如何共享、转让、公开披露、委托处理个人信息
我们已知晓对外共享、转让、公开披露、委托处理个人信息所承担的相应法律责任，我们仅会在本隐私政策约定的范围内共享、转让、公开披露、委托处理您的个人信息。除非存在以下一种或者多种情形，否则我们不会与任何第三方公司、组织和个人共享您的个人信息。
（一）个人信息的共享
我们不会向SButler服务提供者以外的第三方共享您的个人信息，但以下情况除外：
1、在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。
2、在法定情形下的共享：我们可能会根据法律法规规定、诉讼争议解决需要，或按行政、司法机关依法提出的要求，对外共享您的个人信息。
3、个人信息是去标识化处理后的信息，且共享第三方无法重新识别此类信息的自然人主体，或者根据法律法规规定、诉讼争议解决需要。
4、与关联公司间共享：为便于我们基于SButler账户向您提供产品和服务，推荐您可能感兴趣的信息，识别会员账号异常，保护SButler关联公司或其他用户或公众的人身财产安全免遭侵害，您的个人信息可能会与我们的关联公司和/或其指定的服务提供商共享。我们只会共享必要的个人信息，且受本隐私政策中所声明目的的约束，如果我们共享您的个人敏感信息或关联公司改变个人信息的使用及处理目的，将再次征求您的授权同意；
5、与授权合作伙伴共享：为防止非法注册和非法登录，保护平台及用户安全，以及提供更好的客户服务和用户体验，我们可能委托授权合作伙伴为您提供某些服务或代表我们履行职能，我们仅会出于本隐私政策声明的合法、正当、必要、特定、明确的目的共享您的信息，授权合作伙伴只能接触到其履行职责所需信息，且不得将此信息用于其他任何目的。
请您知悉：该等共享的第三方为数据控制者，以其自己的名义获得您的同意以处理您的个人信息。合作方可能有其独立的隐私政策和用户协议，我们建议您认真阅读并遵守第三方的用户协议及隐私政策。 我们将要求第三方对您的个人信息采取保护措施并且严格遵守相关法律法规与监管要求。第三方如要改变本政策约定的个人信息的处理目的，将再次征求您的授权同意。
目前，我们的授权合作伙伴包括以下类型：
（1）广告、分析服务类的授权合作伙伴。除非得到您的许可，否则我们不会将您的个人身份信息与提供广告、分析服务的合作伙伴共享。我们会向这些合作伙伴提供有关其广告覆盖面和有效性的信息，但不会提供您的个人身份信息，或者我们将这些信息进行汇总，以便它不会识别您个人。这类合作伙伴可能将上述信息与他们合法获取的其他数据相结合，以进行广告或决策建议；
（2）供应商、服务提供商和其他合作伙伴。我们将信息发送给支持我们业务的供应商、服务提供商和其他合作伙伴，这些支持包括提供技术基础设施服务、分析我们服务的使用方式、衡量广告和服务的有效性、提供客户服务、支付便利或进行学术研究和调查。
我们共享这些信息仅为实现本政策中声明的目的。在您同意后后台/静默可能会收集您的设备信息（例如设备IP地址、国际移动设备身份识别码（IMEI）、网络设备硬件地址（MAC）、设备硬件序列号、设备安装应用列表） ，并经过去标识化处理后提供给前述合作伙伴。我们仅会出于合法、正当、合理、必要、特定、明确的目的共享您的个人信息，并且只会向授权合作伙伴共享其提供服务所必要的个人信息。我们的授权合作伙伴无权将共享的个人信息用于任何其他用途、目的。我们会与其约定严格的数据保护措施，令其按照我们的说明、本隐私政策以及其他任何相关的保密和安全措施来处理个人信息。
6、当您选择参加我们举办的有关营销活动时，根据活动需要您可提供姓名、通信地址、联系方式、银行账号等信息，以便第三方能及时向您提供奖品。经过您的明示同意，我们会将上述信息与第三方共享，以便我们能委托第三方及时向您提供奖品。
我们会对共享个人信息第三方主体的谨慎评估及责任约束：
（1）经您同意，我们只会与第三方共享实现目的所必要的信息。如果第三方因业务需要，确需超出前述授权范围使用个人信息的，该第三方将需再次征求您的自主选择同意。
（2）对我们与之共享您个人信息的第三方，该些第三方会与我们签订保密协议。同时，我们会对其数据安全能力与环境进行评估并要求第三方以不低于本隐私政策所要求的保密和安全措施来处理该些信息。
（二）个人信息的转让
我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
（1）在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；
（2）在涉及合并、收购、资产转让或破产清算情形，或其他涉及合并、收购或破产清算情形时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本隐私政策的约束，否则我们将要求该公司、组织和个人重新向您征求授权同意。
（三）个人信息的公开披露
我们仅会在以下情况下，公开披露您的个人信息：
1. 获得您明确同意或基于您的主动选择，我们可能会公开披露您的个人信息；
2. 如果我们确定您出现违反法律法规或严重违反SButler相关协议及规则的情况，或为保护其他用户或公众的人身财产安全免遭侵害，我们可能依据法律法规或征得您同意的情况下披露关于您的个人信息，包括相关违规行为以及SButler已对您采取的措施。
对违规账号、欺诈行为等违反SButler协议及平台规则进行处罚公告时，我们可能会披露相关账号的信息。
（四）依法豁免征得同意共享、转让、公开披露的个人信息
请您理解，在下列情形中，根据法律法规及国家标准，我们共享、转让、公开披露您的个人信息无需征得您的授权同意：
（1）与国家安全、国防安全有关的；
（2）与公共安全、公共卫生、重大公共利益有关的；
（3）与犯罪侦查、起诉、审判和判决执行等有关的；
（4）出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您的同意的；
（5）您自行向社会公众公开的个人信息；
（6）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。
（7）为了实现风险控制和欺诈识别的目的，进而保护您的账户和交易安全，我们的产品可能会集成第三方的 SDK 或类似应用程序，具体如下：

第三方	所涉信息	用途
友盟SDK	设备信息（IMEI/Mac/Android ID/IDFA/OPENUDID/GUID/SIM 卡 IMSI /地理位置等）	统计分析
百度移动统计（BaiduMobAd）	定位权限，网络访问，wifi状态访问，运营商信息，设备信息	统计分析
高德地图	定位权限，网络访问，wifi状态访问，运营商信息，设备信息	提供地图及定位功能
网易易盾	设备 MAC 地址、蓝牙 MAC 地 址、SIM 卡信息（如 ICCID、IMSI、运营商信息等）、唯一设备识别码（如 IMEI、IDFA、 安卓 ID 等）、设备的基本配置信息（如 CPU、内存、屏幕、型号、操作系统等）、网络信 息（如 WIFI 及蜂窝网络信息、IP 地址、时间戳等）、安装软件列表、系统及软件相 关配置信息等	实现内容过滤功能
数美天网	定位权限，电话状态，读写器外部存储，网络访问，wifi状态访问，内置传感器信息，设备信息，获取系统安装的应用程序，获取IMEI信息，获取MAC	提供黑产检测功能
腾讯bugly	电话状态，读写器外部存储，网络访问，wifi状态访问	实现上报程序bug信息的功能
声网	录音麦克风权限，电话状态，wifi状态访问，网络状态，运营商信息，蓝牙访问，网络访问，修改音频设置，读写外部存储，保持设备唤醒	提供实时音频云服务
上海七牛云对象存储	网络访问，读写外部存储	上传用户头像、帖子文件等
阿里云实人认证	电话状态，读写外部存储，访问摄像头权限，获取系统安装的应用信息，获取IMEI信息，获取MAC	实现实名认证人脸识别功能
ShareSDK	相册权限（是）	实现用户共享指定内容功能
支付宝	手机状态和身份，存储卡内容	唤起支付宝app完成支付
微信	手机状态和身份，存储卡内容	唤起微信app完成支付
linkdme	设备信息（IMEI/Mac/Android ID/IDFA/OPENUDID/GUID/SIM 卡 IMSI	实现移动应用的一键拉新、场景还原、渠道分析等功能
依图SDK	录音麦克风权限，电话状态，wifi状态访问，网络状态，运营商信息，蓝牙访问，网络访问，修改音频设置，读写外部存储，保持设备唤醒	实时语音转写
（五）委托处理个人信息
我们提供的直播业务的某些特定功能由外部授权供应商提供，如聘请服务提供商协助我们对实名认证用户完成人脸识别。对我们委托处理个人信息的公司、组织和个人，我们会与委托方签署严格的保密协议，要求其按照我们的要求、本隐私政策以及其他任何相关的保密和安全措施来处理个人信息。

五、我们如何保护个人信息安全
（一）我们非常重视您个人信息的安全，将努力采取合理的安全措施（包括技术方面和管理方面）来保护您的个人信息，防止您提供的个人信息被不当使用或未经授权的情况下被访问、公开披露、使用、修改、损坏、丢失或泄漏，包括但不限于SSL、信息加密存储、数据中心的访问控制。
（二）我们会使用不低于行业同行的加密技术、匿名化处理等合理可行的手段保护您的个人信息，并使用安全保护机制防止您的个人信息遭到恶意攻击。
（三）我们会建立专门的安全部门、安全管理制度、数据安全流程保障您的个人信息安全。我们对可能接触到您的信息的员工或外包人员也采取了严格管理，包括但不限于根据岗位的不同采取不同的权限控制，与他们签署保密协议，监控他们的操作情况等措施。我们采取严格的数据使用和访问制度，确保只有授权人员才可访问您的个人 信息，并适时对数据和技术进行安全审计。
（四）尽管已经采取了上述合理有效措施，并已经遵守了相关法律规定要求的标准，但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全，我们将尽力确保您提供给我们的个人信息的安全性。您知悉并理解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。因此，我们强烈建议您采取积极措施保护个人信息的安全，包括但不限于使用复杂密码、定期修改密码、不将自己的账号密码等个人信息透露给他人，请妥善保管您的账户及密码信息。我们将通过向其它服务器备份、对用户密码进行加密等现有技术提供相应的安全措施确保您的信息不丢失，不被滥用和变造、泄露。
（五）我们会制定应急处理预案，并在发生用户信息安全事件时立即启动应急预案，努力阻止该等安全事件的影响和后果扩大。一旦发生用户信息安全事件（泄露、丢失等）后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已经采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以推送通知、邮件、信函、短信等形式告知您，难以逐一告知时，我们会采取合理、有效的方式发布公告。同时，我们还将按照相关监管部门要求，上报用户信息安全事件的处置情况。
（六）我们谨此特别提醒您，本隐私政策提供的个人信息保护措施仅适用于“SButler”软件及相关服务。一旦您离开“SButler”及相关服务，浏览或使用其他网站、服务及内容资源，我们即没有能力及义务保护您在“SButler”软件及相关服务之外的软件、网站提交的任何个人信息，无论您登录、浏览或使用上述软件、网站是否基于“SButler”的链接或引导。
（七）在使用我们平台服务进行网上交易时，您不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，如银行账户信息、联络方式或者邮政地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是您的账户及密码发生泄露，请您立即联络我们客服，以便我们采取相应措施。

六、您如何访问和管理您的个人信息
我们非常重视您对个人信息的管理，并尽全力保护您对于您个人信息的访问、修改（更新或更正）、删除以及撤回授权同意的权利，以使您拥有充分的能力保障您的隐私和安全。
（一）访问、更正、删除您的个人信息
您可以通过以下方式管理您的信息：
当您完成“SButler”的账号注册、登录并进行合理和必要的身份验证后，您可以查阅、修改、删除您提交给“SButler”软件及相关服务的个人信息（包括删除您已经发布的评论、视频、音频，修改昵称、头像等）。
一般情况下，您可以直接删除您发布的内容，或是在客户端应用程序中点击右下方的【我的】进入个人中心，随时浏览、修改、删除自己提交的信息，但出于安全性和身份识别的考虑，您可能无法自主修改注册时提交的某些初始注册信息；如您确有必要修改该类信息，请您通过微信或客服联系我们，公司将尽快审核所涉问题，并由专人验证您的用户身份后及时予以回复。
（二）注销您的账号
在您注销账号前，我们将验证您的个人身份、安全状态、设备信息等，在您成功发起注销之日起，满足平台注销协议中的条件时，7个自然日后将注销成功 。您知悉并理解，注销账号的行为是不可逆的行为，当您注销账号后，我们将删除有关您账号的一切信息或对相关信息进行匿名化处理，但法律法规另有规定的除外，目前应用内支持注销账号，在应用设置--注销账号中自助进行注销申请操作。
（三）投诉举报
您可以按照我们公示的制度进行投诉或举报。如果您认为您的个人信息权利可能受到侵害，或者发现侵害个人信息权利的线索，您可以通过点击“头像”，进入用户反馈界面与我们联系。我们核查后会在30日内反馈您的投诉与举报。
（四）访问隐私政策
您可以在注册页面，或者在登录个人账号【我的】—【用户协议】查看本隐私政策的全部内容。
（五）停止运营向您告知权利
如我们停止运营，我们将及时停止收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，并对所持有的您的个人信息进行删除或匿名化处理。
（六）改变您授权同意的范围
每个业务功能需要一些基本的个人信息才能得以完成。您可以通过改变手机、平板电脑等智能移动设备的设置或通过上方列举的方式向我们给予或收回授权同意。当您收回相关的授权同意后，我们将不再处理相应的个人信息。但您收回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。
（七）我们如何响应您的上述请求
在您访问、修改或删除相关信息或账号时，我们可能会要求您进行身份验证，以保障帐号的安全。
请您理解，由于技术所限、法律或监管要求，我们可能无法满足您的所有要求，我们会在合理的期限内答复您的请求。同时，按照相关法律法规及国家标准，在以下情形中，我们可能无法响应您的请求：
（1） 与国家安全、国防安全直接相关的；
（2）与公共安全、公共卫生、重大公共利益直接相关的；
（3）与犯罪侦查、起诉、审判和执行判决等直接相关的；
（4）有充分证据表明您存在主观恶意或滥用权利的；
（5）响应您的请求将导致其他个人、组织的合法权益受到严重损害的；
（6）涉及商业秘密的。

七、未成年人条款
若您是未满18周岁的未成年人，在使用“SButler”软件及相关服务前，应在您的父母或其他监护人监护、指导下共同阅读并同意本隐私政策及《SButler护苗计划》具体政策内容，并在征得您的父母或监护人的同意之后，在他们的指导下使用我们的服务。
我们根据国家相关法律法规的规定保护未成年人的个人信息，只会在法律允许、父母或其他监护人明确同意或保护未成年人所必要的情况下收集、使用、共享或披露未成年人的个人信息；如果我们发现在未事先获得可证实的父母同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关信息。
若您是未成年人的监护人，当您对您所监护的未成年人的个人信息有相关疑问时，请通过本隐私政策公示的联系方式与我们联系。

八、隐私政策的修订和通知
（一）为了给您提供更好的服务，“SButler”软件及相关服务将不时更新与变化，我们会适时对本隐私政策进行修订，该等修订构成本隐私政策的一部分并具有等同于本隐私政策的效力。但未经您明确同意，我们不会削减您依据当前生效的本隐私政策所应享受的权利。
（二）本隐私政策更新后，我们会在“SButler”应用程序客户端和官方网站发出更新版本，并在更新后的条款生效前以适当的方式提醒您更新的内容，以便您及时了解本隐私政策的最新版本。如您继续使用我们的服务，表示同意接受修订后的本隐私政策的内容，但是如果更新的内容需要采集音频、获取您联系方式等个人敏感信息，仍会再次以显著方式征求您的同意。
（三）对于重大变更，我们还会提供更为显著的通知（我们会通过包括但不限于邮件、短信、私信或在浏览页面做特别提示、弹窗提示等方式，说明隐私政策的具体变更内容）
本隐私政策所指的重大变更包括但不限于：
1.我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息的类型、个人信息的使用方式等；
2.我们在所有权结构、股权架构等方面发生重大变化。如业务调整、破产并购等引起的所有变更等；
3.个人信息共享、转让或公开披露的主要对象发生变化；
4.您参与个人信息处理方面的权利及其行使方式发生重大变化；
5.我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时。

九、适用范围
本隐私权政策适用于由广州展趣信息科技有限公司及其关联方提供的所有服务，包括SButler客户端、网站等，不适用于未纳入本隐私权政策的其他独立第三方向您提供的产品或服务。例如我们平台上的第三方依托我们平台向您提供服务时，您向第三方提供的个人信息不适用于本隐私政策，我们对任何第三方使用由您提供的信息不承担任何责任。
本隐私政策中所述的“SButler”及相关服务有可能会根据您所使用的手机型号、系统版本、软件应用程序版本等因素而有所不同。最终的产品和服务以您所使用的“SButler”软件及相关服务为准。
如对本隐私政策内容有任何疑问、意见或建议，您可通过登录“SButler”客户端内的“反馈与帮助”页面或联系客服与我们联系。

十、其他
（一）本“隐私政策”中的标题仅为方便及阅读而设，并不影响本《隐私政策》中任何规定的含义或解释。
（二）本“隐私政策”相关词语释义：
1.您是指使用“SButler”软件或服务的用户。
2.“SButler”软件及相关服务是指公司及其关联方通过合法拥有并运营的、标注名称为“SButler”的客户端应用程序，向您提供的产品与服务，包括但不限于音频直播、浏览及互动等功能。
3. 个人信息是指，以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息，包括个人身份信息（姓名、出生日期、性别等）、地址、联系电话、网络身份识别信息（包括账号名、账号昵称、邮箱地址）；财产信息、交易信息、个人上网记录（网络浏览记录、点击记录等）、个人常用设备信息（包括硬件型号、设备MAC地址、操作系统类型、软件列表唯一设备识别码等在内的描述个人常用终端设备基本情况的信息）、个人位置信息等。
4. 个人敏感信息是指，一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。本隐私政策中的个人敏感信息包括：包括个人身份信息、个人生物识别信息、银行账号、通信记录和内容、财产信息、交易信息；网络身份识别信息（包括账号名、账号昵称、邮箱地址以及与前述有关的密码与密码保护问题和答案）、征信信息、行踪轨迹、住宿信息、健康生理信息、交易信息、14周岁以下（含）儿童的个人信息等。
（三）本隐私政策的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律，并明确排除其冲突法规范的适用。 若您和我们发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本隐私政策签订地（中国广东省广州市）有管辖权的人民法院管辖。
（四）本“隐私政策”的版权为我们所有，在法律允许的范围内，我们拥有解释和修改的权利。

''';
