String userAgreement = '''
SButler用户协议
特别提示

成都托云信息科技有限公司（以下简称“成都托云”）在此特别提醒您（用户）在注册成为用户之前，请认真阅读（未成年人须在监护人陪同下阅读）本《用户协议》（以下简称“协议”），确保您充分理解本协议中各条款。特别提示您，本协议中包含隐私保护、未成年人保护、争议解决等涉及您重要权利处分的条款，请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权注册、登录或使用本协议所涉服务。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。

本协议约定成都托云与用户之间关于“SButler”软件服务（以下简称“服务”）的权利义务。“用户”是指注册、登录、使用本服务的个人。本协议可由成都托云随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在本网站查阅最新版协议条款。在成都托云修改协议条款后，如果用户不接受修改后的条款，请立即停止使用成都托云提供的服务，用户继续使用成都托云提供的服务将被视为接受修改后的协议。

一、帐号注册

1、用户在使用本服务前需要注册一个“SButler”帐号。“SButler”帐号是成都托云提供服务授予用户的凭证，“SButler”帐号是成都托云提供的计算机软件作品的一部分，即成都托云将相关产品计算机软件著作权授权给注册用户的授权凭证。成都托云可以根据用户需求或产品需要对帐号注册和绑定的方式进行变更，而无须事先通知用户。

2、您同意成都托云在注册时自动提取您的手机设备识别码等信息用于注册。

3、在用户注册及使用本服务时，成都托云需要搜集能识别用户身份的个人信息以便成都托云可以在必要时联系用户，或为用户提供更好的使用体验。成都托云搜集的信息可能包括用户的姓名、性别、年龄、出生日期、身份证号、地址、学校情况、公司情况、所属行业、兴趣爱好、常出没的地方、个人说明；成都托云同意对这些信息的使用将受限于第三条用户个人隐私信息保护的约束。

二、服务内容

1、本服务的具体内容由成都托云根据实际情况提供，包括但不限于授权用户通过其帐号进行即时通讯、添加好友、加入群组、关注他人、发布留言。成都托云可以对其提供的服务予以变更，且成都托云提供的服务内容可能随时变更；用户将会收到成都托云关于服务变更的通知。

2、成都托云提供的服务包含免费服务与付费服务。付费服务的主要内容为“虚拟礼物”。用户可以通过付费的方式购买付费服务及其服务内容，具体方式为：用户通过网上银行、支付宝、微信支付或其他“SButler”平台提供的付费途径支付一定数额的人民币购买“SButler”平台的虚拟货币--金币，然后根据成都托云公布的资费标准以金币购买平台虚拟礼物，只有用户根据提示确认其同意按照前述支付方式支付费用并完成了支付行为，用户才能获取并使金币并购买虚拟礼物。支付行为的完成以银行或第三方支付平台生成“支付已完成”的确认通知为准。

三、用户个人隐私信息保护

1、用户在注册帐号或使用本服务的过程中，可能需要填写或提交一些必要的信息，如法律法规、规章规范性文件（以下称“法律法规”）规定的需要填写的身份信息。如用户提交的信息不完整或不符合法律法规的规定，则用户可能无法使用本服务或在使用本服务的过程中受到限制。

2、个人隐私信息是指涉及用户个人身份或个人隐私的信息，比如，用户真实姓名、身份证号、手机号码、手机设备识别码、IP地址、用户聊天记录。非个人隐私信息是指用户对本服务的操作状态以及使用习惯等明确且客观反映在成都托云服务器端的基本记录信息、个人隐私信息范围外的其它普通信息，以及用户同意公开的上述隐私信息。

3、尊重用户个人隐私信息的私有性是成都托云的一贯制度，成都托云将采取技术措施和其他必要措施，确保用户个人隐私信息安全，防止在本服务中收集的用户个人隐私信息泄露、毁损或丢失。在发生前述情形或者成都托云发现存在发生前述情形的可能时，将及时采取补救措施。

4、成都托云未经用户同意不向任何第三方公开、 透露用户个人隐私信息。但以下特定情形除外：

(1) 成都托云根据法律法规规定或有权机关的指示提供用户的个人隐私信息；

(2) 由于用户将其用户密码告知他人或与他人共享注册帐号与密码，由此导致的任何个人信息的泄漏，或其他非因成都托云原因导致的个人隐私信息的泄露；

(3) 用户自行向第三方公开其个人隐私信息；

(4) 用户与成都托云及合作单位之间就用户个人隐私信息的使用公开达成约定，成都托云因此向合作单位公开用户个人隐私信息；

(5) 任何由于黑客攻击、电脑病毒侵入及其他不可抗力事件导致用户个人隐私信息的泄露。

5、用户同意成都托云可在以下事项中使用用户的个人隐私信息：

(1) 成都托云向用户及时发送重要通知，如软件更新、本协议条款的变更；

(2) 成都托云内部进行审计、数据分析和研究等，以改进成都托云的产品、服务和与用户之间的沟通；

(3) 依本协议约定，成都托云管理、审查用户信息及进行处理措施；

(4) 适用法律法规规定的其他事项。

除上述事项外，如未取得用户事先同意，成都托云不会将用户个人隐私信息使用于任何其他用途。

6、成都托云重视对未成年人个人隐私信息的保护。成都托云将依赖用户提供的个人信息判断用户是否为未成年人。任何18岁以下的未成年人注册帐号或使用本服务应事先取得法定监护人（以下简称"监护人"）的书面同意。除根据法律法规的规定及有权机关的指示披露外，成都托云不会使用或向任何第三方透露未成年人的聊天记录及其他个人隐私信息。除本协议约定的例外情形外，未经监护人事先同意，成都托云不会使用或向任何第三方透露未成年人的个人隐私信息。

7、为了改善成都托云的技术和服务，向用户提供更好的服务体验，成都托云可自行收集使用或向第三方提供用户的非个人隐私信息。

8、成都托云可能会获取的权限：

(1) 读取相册照片权限：用于上传头像、上传图片到我的相册、保存图片到相册、发送图片、发表动态；

(2)相机权限：用于上传头像、上传图片到我的相册、发送图片、发表动态、实名认证；

(3) 麦克风权限：用于语音房通话、发送语音、录制声音；

(4)位置获取权限：基于网络的大概位置，用于用户地理位置显示。

对于使用安卓系统的用户，在使用SButler产品时，成都托云可能获取您终端设备以下权限，以维护提升产品，提供更好的服务：

(5) 读取手机状态：用于监听网络状态；

(6)写入磁盘：用于缓存文件、日志记录。

四、内容规范

1、本条所述内容是指用户使用本服务过程中所制作、上载、复制、发布、传播的任何内容，包括但不限于帐号头像、名称、用户说明等注册信息及认证资料，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用帐号或本服务所产生的内容。

2、用户不得利用“SButler”帐号或本服务制作、上载、复制、发布、传播如下法律、法规和政策禁止的内容：

(1) 反对宪法所确定的基本原则的；

(2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；

(3) 损害国家荣誉和利益的；

(4) 歪曲、丑化、亵渎、否定英雄烈士事迹和精神，以侮辱、诽谤或者其他方式侵害英雄烈士的姓名、肖像、名誉、荣誉的；

(5) 宣扬恐怖主义、极端主义或者煽动实施恐怖活动、极端主义活动的；

(6) 煽动民族仇恨、民族歧视，破坏民族团结的；

(7) 破坏国家宗教政策，宣扬邪教和封建迷信的；

(8) 散布谣言，扰乱社会秩序，破坏社会稳定的；

(9) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；

(10)侮辱或者诽谤他人，侵害他人名誉、隐私和其他合法权益的；

(11)不遵守法律法规底线、社会主义制度底线、国家利益底线、公民合法权益底线、社会公共秩序底线、道德风尚底线和信息真实性底线的“七条底线”要求的；

(12)含有法律、行政法规禁止的其他内容的信息。

3、用户不得利用“SButler”帐号或本服务制作、上载、复制、发布、传播如下干扰“SButler”正常运营，以及侵犯其他用户或第三方合法权益的内容：

(1) 使用夸张标题，内容与标题严重不符的；

(2) 炒作绯闻、丑闻、劣迹等的；

(3) 不当评述自然灾害、重大事故等灾难的；

(4) 含有任何性或性暗示、性挑逗等易使人产生性联想的；

(5) 展现血腥、惊悚、残忍等致人身心不适的；

(6) 煽动人群歧视、地域歧视等的；

(7) 宣扬低俗、庸俗、媚俗内容的；

(8) 可能引发未成年人模仿不安全行为和违反社会公德行为、诱导未成年人不良嗜好等的；

(9) 含有辱骂、恐吓、威胁内容的；

(10)含有骚扰、垃圾广告、恶意信息、诱骗信息的；

(11)涉及他人隐私、个人信息或资料的；

(12)侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；

(13)含有其他对网络生态造成不良影响的内容，或其他干扰本服务正常运营和侵犯第三方合法权益内容的信息。

五、使用规则

1、用户在本服务中或通过本服务所传送、发布的任何内容并不反映或代表，也不得被视为反映或代表成都托云的观点、立场或政策，成都托云对此不承担任何责任。

2、用户不得利用“SButler”帐号或本服务进行如下行为：

(1) 提交、发布虚假信息，或盗用他人头像或资料，冒充、利用他人名义的；

(2) 强制、诱导其他用户关注、点击链接页面或分享信息的；

(3) 虚构事实、隐瞒真相以误导、欺骗他人的；

(4) 利用技术手段批量建立虚假帐号的；

(5) 利用“SButler”帐号或本服务从事任何违法犯罪活动的；

(6) 制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的；

(7) 其他违反法律法规规定、侵犯其他用户合法权益、干扰“SButler”正常运营或成都托云未明示授权的行为。

3、用户须对利用“SButler”帐号或本服务传送信息的真实性、合法性、无害性、准确性、有效性等全权负责，与用户所传播的信息相关的任何法律责任由用户自行承担，与成都托云无关。如因此给成都托云或第三方造成损害的，用户应当依法予以赔偿。

4、成都托云提供的服务中可能包括广告，用户同意在使用过程中显示成都托云和第三方供应商、合作伙伴提供的广告。除法律法规明确规定外，用户应自行对依该广告信息进行的交易负责，对用户因依该广告信息进行的交易或前述广告商提供的内容而遭受的损失或损害，成都托云不承担任何责任。

5、用户须明白，在使用SButler服务过程中，可能存在有来自任何他人的包括威胁性的、诽谤性的、令人反感的或非法的内容或行为或对他人权利的侵犯（包括知识产权）的匿名或冒名的信息的风险，用户须承担以上风险，成都托云对服务不作担保，不论是明确的或隐含的，包括所有有关信息真实性、适当性、适于某一特定用途、所有权和非侵权性的默示担保和条件，对因此导致任何因用户不正当或非法使用服务产生的直接、间接、偶然、特殊及后续的损害，不承担任何责任。

六、虚拟货币

1、成都托云将在“SButler”平台发行虚拟货币，即金币。金币可用于购买“SButler”平台的增值服务，包括但不限于虚拟礼物，除此外，不得用于其他任何用途。该等增值服务的价格均以金币为单位，具体价格信息将由成都托云自行决定并在相关服务页面上显示。

2、金币和人民币的兑换比例是10:1，兑换比例将由成都托云根据运营情况随时变更，并将在用户购买金币的相关服务页面上显示。

3、用户默认已开通金币账户，可进行金币购买和消费。用户可在设置页面查询到金币余额、购买记录和消费记录。金币相关信息将不作为公开信息。

4、用户确认，金币一经充值成功，除法律法规明确规定外，在任何情况下不能兑换为法定货币，不能转让他人。除法律法规明确规定外，金币账户充值完成后，成都托云不予退款。

5、用户可以通过网上银行、支付宝或其他“SButler”平台提供的充值途径为金币账户进行充值。用户使用金币购买虚拟礼物后，可将虚拟礼物赠与其他用户。

6、用户确认，金币只能用于购买“SButler”平台上的各类增值服务，任何情况下不得与成都托云以外的第三方进行金币交易，亦不得在除“SButler”平台以外的第三方平台（如淘宝）上进行交易；如违反前述约定，造成用户或第三方任何损失，成都托云不负任何责任，且如成都托云有理由怀疑用户的金币账户或使用情况有作弊或异常状况，成都托云将拒绝该用户使用金币进行支付，直至按本协议约定采取相关封禁措施。

7、用户确认，除法律法规明确规定或本协议另有约定外，用户已购买的任何收费服务不能以任何理由退购（即退换成金币或法定货币）或调换成其他服务。

8、获赠礼物的用户将有一个“金币礼物”账户，金币礼物无法购买平台增值服务但可进行提现操作，提现的最小单位为1000金币礼物。提现的金币礼物和人民币兑换比例是10：1，兑换比例将由成都托云根据运营情况随时变更，并将在用户提现的相关服务页面上显示。

七、账户管理

1、 “SButler”帐号的所有权归成都托云所有，用户完成申请注册手续后，获得“SButler”帐号的使用权，该使用权仅属于初始申请注册人，禁止赠与、借用、租用、转让或售卖。成都托云因经营需要，有权回收用户的“SButler”帐号。

2、用户可以更改、删除“SButler”帐户上的个人资料、注册信息及传送内容等，但需注意，删除有关信息的同时也会删除用户储存在系统中的文字和图片。用户需承担该风险。

3、用户有责任妥善保管注册帐号信息及帐号密码的安全，因用户保管不善可能导致遭受盗号或密码失窃，责任由用户自行承担。用户需要对注册帐号以及密码下的行为承担法律责任。用户同意在任何情况下不使用其他用户的帐号或密码。在用户怀疑他人使用其帐号或密码时，用户同意立即通知成都托云。

4、用户应遵守本协议的各项条款，正确、适当地使用本服务，如因用户违反本协议中的任何条款，成都托云在通知用户后有权依据协议中断或终止对违约用户“SButler”帐号提供服务。同时，成都托云保留在任何时候收回“SButler”帐号、用户名的权利。

5、如用户注册“SButler”帐号后一年不登录，通知用户后，成都托云可以收回该帐号，以免造成资源浪费，由此造成的不利后果由用户自行承担。

八、数据储存

1、成都托云不对用户在本服务中相关数据的删除或储存失败负责。

2、成都托云可以根据实际情况自行决定用户在本服务中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。用户可根据自己的需要自行备份本服务中的相关数据。

3、如用户停止使用本服务或本服务终止，成都托云可以从服务器上永久地删除用户的数据。本服务停止、终止后，成都托云没有义务向用户返还任何数据。

九、风险承担

1、用户理解并同意，“SButler”仅为用户提供信息分享、传送及获取的平台，用户必须为自己注册帐号下的一切行为负责，包括用户所传送的任何内容以及由此产生的任何后果。用户应对“SButler”及本服务中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。成都托云无法且不会对因用户行为而导致的任何损失或损害承担责任。如果用户发现任何人违反本协议约定或以其他不当的方式使用本服务，请立即向成都托云举报或投诉，成都托云将依本协议约定进行处理。

2、用户理解并同意，因业务发展需要，成都托云保留单方面对本服务的全部或部分服务内容变更、暂停、终止或撤销的权利，用户需承担此风险。

十、知识产权声明

1、除本服务中涉及广告的知识产权由相应广告商享有外，成都托云在本服务中提供的内容（包括但不限于网页、文字、图片、音频、视频、图表等）的知识产权均归成都托云所有，但用户在使用本服务前对自己发布的内容已合法取得知识产权的除外。

2、除另有特别声明外，成都托云提供本服务时所依托软件的著作权、专利权及其他知识产权均归成都托云所有。

3、成都托云在本服务中所涉及的图形、文字或其组成，以及其他成都托云标志及产品、服务名称（以下统称“成都托云标识”），其著作权或商标权归成都托云所有。未经成都托云事先书面同意，用户不得将成都托云标识以任何方式展示或使用或作其他处理，也不得向他人表明用户有权展示、使用、或其他有权处理成都托云标识的行为。

4、上述及其他任何成都托云或相关广告商依法拥有的知识产权均受到法律保护，未经成都托云或相关广告商书面许可，用户不得以任何形式进行使用或创造相关衍生作品。

十一、法律责任

1、如果成都托云发现或收到他人举报或投诉用户违反本协议约定的，成都托云有权不经通知随时对相关内容，包括但不限于用户资料、聊天记录进行审查、删除，并视情节轻重对违规帐号处以包括但不限于警告、帐号封禁 、设备封禁 、功能封禁的处罚，且通知用户处理结果。

2、因违反用户协议被封禁的用户，在登陆时会收到封禁期限的提示，并在封禁期限届满后自助解封。其中，被实施功能封禁的用户会在封禁期届满后自动恢复被封禁功能。被封禁用户可通过成都托云的客服渠道提交申诉，成都托云将对申诉进行审查，并自行合理判断决定是否变更处罚措施。

3、用户理解并同意，成都托云有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应承担由此而产生的一切法律责任。

4、用户理解并同意，因用户违反本协议约定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，用户应当赔偿成都托云与合作公司、关联公司，并使之免受损害。

十二、不可抗力及其他免责事由

1、用户理解并确认，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，成都托云将努力在第一时间与相关单位配合，及时进行修复，但是由此给用户或第三方造成的损失，成都托云及合作单位在法律允许的范围内免责。

2、本服务同大多数互联网服务一样，受包括但不限于用户原因、网络服务质量、社会环境等因素的差异影响，可能受到各种安全问题的侵扰，如他人利用用户的资料，造成现实生活中的骚扰；用户下载安装的其它软件或访问的其他网站中含有“特洛伊木马”等病毒，威胁到用户的计算机信息和数据的安全，继而影响本服务的正常使用等等。用户应加强信息安全及使用者资料的保护意识，要注意加强密码保护，以免遭致损失和骚扰。

3、用户理解并确认，本服务存在因不可抗力、计算机病毒或黑客攻击、系统不稳定、用户所在位置、用户关机以及其他任何技术、互联网络、通信线路原因等造成的服务中断或不能满足用户要求的风险，因此导致的用户或第三方任何损失，成都托云不承担任何责任。

4、用户理解并确认，在使用本服务过程中存在来自任何他人的包括误导性的、欺骗性的、威胁性的、诽谤性的、令人反感的或非法的信息，或侵犯他人权利的匿名或冒名的信息，以及伴随该等信息的行为，因此导致的用户或第三方的任何损失，成都托云不承担任何责任。

5、用户理解并确认，成都托云需要定期或不定期地对“SButler”平台或相关的设备进行检修或者维护，如因此类情况而造成服务在合理时间内的中断，成都托云无需为此承担任何责任，但成都托云应事先进行通告。

6、成都托云依据法律法规、本协议约定获得处理违法违规或违约内容的权利，该权利不构成成都托云的义务或承诺，成都托云不能保证及时发现违法违规或违约行为或进行相应处理。

7、用户理解并确认，对于成都托云向用户提供的下列产品或者服务的质量缺陷及其引发的任何损失，成都托云无需承担任何责任：

(1) 成都托云向用户免费提供的服务；

(2) 成都托云向用户赠送的任何产品或者服务。

8、在任何情况下，成都托云均不对任何间接性、后果性、惩罚性、偶然性、特殊性或刑罚性的损害，包括因用户使用“SButler”或本服务而遭受的利润损失，承担责任（即使成都托云已被告知该等损失的可能性亦然）。尽管本协议中可能含有相悖的规定，成都托云对用户承担的全部责任，无论因何原因或何种行为方式，始终不超过用户因使用SButler提供的服务而支付给成都托云的费用(如有)。

十三、服务的变更、中断、终止

1、鉴于网络服务的特殊性，用户同意成都托云有权随时变更、中断或终止部分或全部的服务（包括收费服务）。成都托云变更、中断或终止的服务，成都托云应当在变更、中断或终止之前通知用户，并应向受影响的用户提供等值的替代性的服务。

2、如发生下列任何一种情形，成都托云有权变更、中断或终止向用户提供的免费服务或收费服务，而无需对用户或任何第三方承担任何责任：

(1) 根据法律规定用户应提交真实信息，而用户提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明；

(2) 用户违反相关法律法规或本协议的约定；

(3) 按照法律规定或有权机关的要求；

(4) 出于安全的原因或其他必要的情形。

十四、其他

1、成都托云郑重提醒用户注意本协议中免除成都托云责任和限制用户权利的条款，请用户仔细阅读，自主考虑风险。未成年人应在法定监护人的陪同下阅读本协议。

2、本协议的效力、解释及纠纷的解决，适用于中华人民共和国法律。若用户和成都托云之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，用户同意将纠纷或争议提交广州仲裁委员会，按该会现有仲裁规则裁决。

3、本协议的任何条款无论因何种原因无效或不具可执行性，其余条款仍有效，对双方具有约束力。
''';
